package ru.stepanov.java_awesome.core;

public abstract class f1_methods {
    void method() {

    }

    /* STRICTFP - "в этом методе вещественные числа считаются с определенной точностью"
    *  NATIVE - что вызываемый код будет написан на не java языке.
    *  SYNCRONIZED - Use при многопоточности
    *  ABSTRACT - у метода нет реализации. В наследниках мы должны его переопределить.
    *  FINAL - этот метод больше нельзя переопределять.
    *  STATIC - метод, который можно использовать без создания класса.
    * */
}
